h/Christian.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Hegel for the Working Christian I.</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-27 Sun"/>
<meta name="author" content="GW Dean"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Hegel for the Working Christian I.</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Hegel for the Working Christian I. </a>
<ul>
<li><a href="#sec-1.1">1.1 Hegel Overview </a></li>
<li><a href="#sec-1.2">1.2 Key Works </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 The Early Theological Writings (1795-1805) </a></li>
<li><a href="#sec-1.2.2">1.2.2 The Phenomenology of Spirit (Geist) (1807) </a></li>
<li><a href="#sec-1.2.3">1.2.3 The Science of Logic (1812-1816&hellip;continually revised) </a></li>
<li><a href="#sec-1.2.4">1.2.4 The Philosophy of Right (1821) </a></li>
<li><a href="#sec-1.2.5">1.2.5 Lectures on Art, Religion, History, Nature, Philosophy (1820s-1830s) </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Hegel for the Working Christian I. </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Hegel Overview </h3>
<div class="outline-text-3" id="text-1.1">

<ul>
<li>
Dates:    1770-1831
</li>
<li>
Location: Stuttgart/Tubingen/Jena/Berlin
</li>
<li>
Religion: Lutheran
</li>
<li>
Profession: Professor of Philosophy Berlin
</li>
<li>
Influenced By: Christianity,Kant,Plato,Aristotle,Leibniz,Eckhart

</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Key Works </h3>
<div class="outline-text-3" id="text-1.2">

<p>The following are most (but not all) of Hegel's
key works. There are a few others, but this
gives you the general scope of his concerns.
</p>

</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> The Early Theological Writings (1795-1805) </h4>
<div class="outline-text-4" id="text-1.2.1">

<p>The Early Theological Writings are very important
for those interested in the Philosophical and
Theological beliefs that shaped the younger
Hegel's thinking.
</p></div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> The Phenomenology of Spirit (Geist) (1807) </h4>
<div class="outline-text-4" id="text-1.2.2">

</div>

</div>

<div id="outline-container-1.2.3" class="outline-4">
<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> The Science of Logic (1812-1816&hellip;continually revised) </h4>
<div class="outline-text-4" id="text-1.2.3">

<p>The core Hegelian system is contained within 
two works, <i>The Phenomenology of Spirit (Geist)</i>
and the <i>Science of Logic</i>. These are dense
works that need to be worked through over a 
period of time. The <i>PhG</i> and the <i>Science of Logic</i>
are the keys to the Lamborghini.
</p>
<p>
The best pathway into Hegel is to start
with The <i>PhG</i> and then work through the <i>Logic</i>.
Everything else in Hegel emerges from the arguments he 
he lays out in these two works. Mastering the ideas
in the <i>Logic</i> is a good way to learn Western
Thought inside and out.
</p>
<p>
Christians should note that Hegel's <i>Science of Logic</i> is
not mathematical "logic" (in the Russellian sense)
but rather "Logic" relating the Greek <i>LOGOS</i>. <i>Science of the LOGOS</i> might be a better term for the work
than <i>Science of Logic</i>, but we've inherited the 
term "Logic" so that's what we have. 
</p>
</div>

</div>

<div id="outline-container-1.2.4" class="outline-4">
<h4 id="sec-1.2.4"><span class="section-number-4">1.2.4</span> The Philosophy of Right (1821) </h4>
<div class="outline-text-4" id="text-1.2.4">

<p>The <i>Philosophy of Right</i> (1821) is Hegel's
theory of politics. It has been influential across
the board, from Marxists to Neo-Cons to Moderates 
to any one who has to think strategically and 
who is interested in the relationship between 
the "state" and "freedom".
</p>
</div>

</div>

<div id="outline-container-1.2.5" class="outline-4">
<h4 id="sec-1.2.5"><span class="section-number-4">1.2.5</span> Lectures on Art, Religion, History, Nature, Philosophy (1820s-1830s) </h4>
<div class="outline-text-4" id="text-1.2.5">

<p>The <i>Lectures</i> are interesting Philosophical 
Histories about various parts of human life, using
Hegel's trademark philosophical insight.
</p></div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: GW Dean
<a href="mailto:gwdean@gmail.com">&lt;gwdean@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-10-27 Sun</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
